
//-===============================================
//-
//-	エネミーピンのファイル処理のヘッダー[file_enemy_pin.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _FILE_ENEMY_PIN_H_		// このマクロが定義されなかったら
#define _FILE_ENEMY_PIN_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	前方宣言
//-======================================

//-======================================
//-	クラス定義
//-======================================

class CFileEnemyPin
{

public:

	typedef enum
	{
		TXT_ENEMY_PIN_000 = 0,	// 通常敵_000のテキスト
	}TXT;

	CFileEnemyPin();
	~CFileEnemyPin();

	static void Save(CFileEnemyPin::TXT txtType);
	static void Load(CFileEnemyPin::TXT txtType);

private:

};

#endif	// 二重インクルード防止の終了
