
//-===============================================
//-
//-	通常敵ファイル処理のヘッダー[file_emy_nor.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _FILE_EMY_NOR_H_		// このマクロが定義されなかったら
#define _FILE_EMY_NOR_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	前方宣言
//-======================================

//-======================================
//-	クラス定義
//-======================================

class CFileEmyNor
{

public:

	typedef enum
	{
		TXT_NORMAL_000 = 0,	// 通常敵_000のテキスト
	}TXT;

	CFileEmyNor();
	~CFileEmyNor();

	static void Save(CFileEmyNor::TXT txtType);
	static void Load(CFileEmyNor::TXT txtType);

private:

};

#endif	// 二重インクルード防止の終了
