
//-===============================================
//-
//-	ブロックの処理[block.cpp]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	インクルード
//-======================================

#include "block.h"

#include "renderer.h"
#include "manager.h"

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	静的変数宣言
//-======================================

LPDIRECT3DTEXTURE9 CBlock::m_pTexture = NULL;

//-------------------------------------
//-	ブロックのコンストラクタ
//-------------------------------------
CBlock::CBlock(int nPriority) : CObject2d(nPriority)
{

}

//-------------------------------------
//-	ブロックのデストラクタ
//-------------------------------------
CBlock::~CBlock()
{

}

//-------------------------------------
//- ブロックのテクスチャの読み込み
//-------------------------------------
HRESULT CBlock::Load(void)
{
	// デバイスを取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	// デバイスの情報取得の成功を判定
	if (pDevice == NULL)
	{// 失敗時

		// 初期化処理を抜ける
		return E_FAIL;
	}

	// テクスチャの読み込み
	D3DXCreateTextureFromFile(
		pDevice,
		"data\\TEXTURE\\block000.jpg",
		&m_pTexture);

	// テクスチャの読み込み成功の有無を確認
	if (m_pTexture == NULL)
	{
		// 失敗時に初期化処理を抜ける
		return E_FAIL;
	}

	// 成功を返す
	return S_OK;
}

//-------------------------------------
//- ブロックの読み込んだテクスチャの破棄
//-------------------------------------
void CBlock::Unload(void)
{

}

//-------------------------------------
//- ブロックの初期化処理
//-------------------------------------
HRESULT CBlock::Init(void)
{
	// 2Dオブジェクトの初期化
	CObject2d::Init();

	// 成功を返す
	return S_OK;
}

//-------------------------------------
//- ブロックの終了処理
//-------------------------------------
void CBlock::Uninit(void)
{
	// 2Dオブジェクトの終了
	CObject2d::Uninit();
}

//-------------------------------------
//- ブロックの更新処理
//-------------------------------------
void CBlock::Update(void)
{
	// 2Dオブジェクトの更新処理
	CObject2d::Update();
}

//-------------------------------------
//- ブロックの描画処理
//-------------------------------------
void CBlock::Draw(void)
{
	// ブロックの描画処理
	CObject2d::Draw();
}

//-------------------------------------
//- ブロックの生成処理
//-------------------------------------
CBlock *CBlock::Create(void)
{
	// ブロックのポインタを宣言
	CBlock *pCBlock = DBG_NEW CBlock;

	// 生成の成功の有無を判定
	if (pCBlock != NULL)
	{
		// 初期化処理 if(初期化成功の有無を判定)
		if (FAILED(pCBlock->Init()))
		{// 失敗時

			// 「なし」を返す
			return NULL;
		}
	}
	else if (pCBlock == NULL)
	{// 失敗時

		// 「なし」を返す
		return NULL;
	}

	// 種類を設定
	pCBlock->SetType(TYPE_BLOCK);

	//// テクスチャの割当
	//pCBlock->BindTexture(m_pTexture);

	// ブロックのポインタを返す
	return pCBlock;
}