
//-===============================================
//-
//-	ゴミ回収のファイル処理のヘッダー[file_garbage_collect.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _FILE_GARBAGE_COLLECT_H_		// このマクロが定義されなかったら
#define _FILE_GARBAGE_COLLECT_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	前方宣言
//-======================================

//-======================================
//-	クラス定義
//-======================================

class CFileGarbageCollect
{

public:

	typedef enum
	{
		TXT_NORMAL_000 = 0,	// ゴミ回収オブジェクト_000のテキスト
	}TXT;

	CFileGarbageCollect();
	~CFileGarbageCollect();

	static void Save(CFileGarbageCollect::TXT txtType);
	static void Load(CFileGarbageCollect::TXT txtType);

private:

};

#endif	// 二重インクルード防止の終了
