
//-===============================================
//-
//-	クイックタイムイベント処理[qte.cpp]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	インクルード
//-======================================

#include "qte.h"

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	静的変数宣言
//-======================================

//-------------------------------------
//-	クイックタイムイベントのコンストラクタ
//-------------------------------------
CQte::CQte()
{
}

//-------------------------------------
//-	クイックタイムイベントのデストラクタ
//-------------------------------------
CQte::~CQte()
{

}

//-------------------------------------
//- クイックタイムイベントの初期化処理
//-------------------------------------
HRESULT CQte::Init(void)
{
	// 成功を返す
	return S_OK;
}

//-------------------------------------
//- クイックタイムイベントの終了処理
//-------------------------------------
void CQte::Uninit(void)
{
}

//-------------------------------------
//- クイックタイムイベントの更新処理
//-------------------------------------
void CQte::Update(void)
{
}

//-------------------------------------
//- クイックタイムイベントの描画処理
//-------------------------------------
void CQte::Draw(void)
{

}

//-------------------------------------
//- クイックタイムイベントの生成処理
//-------------------------------------
CQte *CQte::Create(void)
{
	// クイックタイムイベントの生成
	CQte *pQte = DBG_NEW CQte;

	// 生成の成功の有無を判定
	if (pQte != NULL)
	{
		// 初期化処理
		if (FAILED(pQte->Init()))
		{// 失敗時

			// 「なし」を返す
			return NULL;
		}
	}
	else if (pQte == NULL)
	{// 失敗時

		// 「なし」を返す
		return NULL;
	}

	// クイックタイムイベントのポインタを返す
	return pQte;
}