
//-===============================================
//-
//-	クイックタイムイベントの処理のヘッダー[qte.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _QTE_H_		// このマクロが定義されなかったら
#define _QTE_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

#include "data.h"

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	前方宣言
//-======================================

//-======================================
//-	クラス定義
//-======================================

class CQte
{
public:

	// クイックタイムイベントの種類
	typedef enum
	{
		TYPE_QTE_TIMING = 0,	// タイミング
		TYPE_QTE_MAX
	}TYPE_QTE;

	CQte();
	virtual ~CQte();

	virtual HRESULT Init(void);
	virtual void Uninit(void);
	virtual void Update(void);
	virtual void Draw(void);

	static CQte *Create(void);

private:


};

#endif	// 二重インクルード防止の終了
