
//-===============================================
//-
//-	当たり判定壁のヘッダー[box_wall.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _BOX_WALL_H_		// このマクロが定義されなかったら
#define _BOX_WALL_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

#include "object3d.h"

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	クラス定義
//-======================================

// アイテムのクラス
class CBoxWall : public CObject3d
{

public:

	CBoxWall(int nPriority = 3);;
	~CBoxWall();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CBoxWall* Create(void);

	void SetVtx(void);

private:

};

#endif	// 二重インクルード防止の終了
