
//-===============================================
//-
//-	オブジェクトファイル処理のヘッダー[map_object_x.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _MAP_OBJECT_X_H_		// このマクロが定義されなかったら
#define _MAP_OBJECT_X_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	前方宣言
//-======================================

//-======================================
//-	クラス定義
//-======================================

class CMapObjectX
{

public:

	typedef enum
	{
		TXT_NORMAL_000 = 0,	// 通常敵_000のテキスト
	}TXT;

	CMapObjectX();
	~CMapObjectX();

	static void Save(CMapObjectX::TXT txtType);
	static void Load(CMapObjectX::TXT txtType);

private:

};

#endif	// 二重インクルード防止の終了
