
//-===============================================
//-
//-	マップ管理処理のヘッダー[map_manager.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _MAP_MANAGER_H_		// このマクロが定義されなかったら
#define _MAP_MANAGER_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	前方宣言
//-======================================

//-======================================
//-	クラス定義
//-======================================

class CMapManager
{

public:

	CMapManager();
	~CMapManager();

	static void GameSave(void);
	static void GameLoad(void);

private:

};

#endif	// 二重インクルード防止の終了
