
//-===============================================
//-
//-	テンプレートの処理のヘッダー[template.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _CHARGE_H_		// このマクロが定義されなかったら
#define _CHARGE_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

#include "object.h"

//=======================================
//=	コンスト定義
//=======================================

namespace TEMPLATE
{
	const int NUM = 0;	// 数
}

//=======================================
//=	前方宣言
//=======================================

//-======================================
//-	クラス定義
//-======================================

class CTemplate : public CObject
{

public:

	CTemplate();
	~CTemplate();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTemplate* Create(void);

private:

};

#endif	// 二重インクルード防止の終了
