
//================================================
//=
//=	テンプレートの処理[template.cpp]
//= Author Sakai Minato
//=
//================================================

//=======================================
//=	インクルード
//=======================================

#include "template.h"

//=======================================
//=	コンスト定義
//=======================================

//=======================================
//=	静的変数宣言
//=======================================

//-------------------------------------
//-	コンストラクタ
//-------------------------------------
CTemplate::CTemplate()
{

}

//-------------------------------------
//-	デストラクタ
//-------------------------------------
CTemplate::~CTemplate()
{

}

//-------------------------------------
//- 初期化処理
//-------------------------------------
HRESULT CTemplate::Init(void)
{
	// 成功を返す
	return S_OK;
}

//-------------------------------------
//- 終了処理
//-------------------------------------
void CTemplate::Uninit(void)
{
	// 自分自身のポインタの開放
	Release();
}

//-------------------------------------
//- 更新処理
//-------------------------------------
void CTemplate::Update(void)
{
}

//-------------------------------------
//- 描画処理
//-------------------------------------
void CTemplate::Draw(void)
{
}

//-------------------------------------
//- 生成処理
//-------------------------------------
CTemplate* CTemplate::Create(void)
{
	// 生成処理
	CTemplate* pTemplate = DBG_NEW CTemplate;

	if (pTemplate != nullptr)
	{
		// 初期化処理
		if (FAILED(pTemplate->Init()))
		{// 失敗時

			return nullptr;
		}
	}
	else if (pTemplate == nullptr)
	{// 失敗時

		return nullptr;
	}

	// ポインタを返す
	return pTemplate;
}