
//-===============================================
//-
//-	キックの処理のヘッダー[kick.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _KICK_H_		// このマクロが定義されなかったら
#define _KICK_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

#include "attack.h"

//=======================================
//=	マクロ定義
//=======================================

//=======================================
//=	前方宣言
//=======================================

class CColl;

//-======================================
//-	クラス定義
//-======================================

class CKick : public CAttack
{

public:

	CKick();
	~CKick();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void InitSet(D3DXVECTOR3 pos, D3DXVECTOR3 size, int nDamage);

	static CKick* Create(void);

private:

};

#endif	// 二重インクルード防止の終了
